9/data/attachments/4c98926ba596b89.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_939e287c-39e9-4206-bdff-c75e5898395a</nif:username>
            <nif:friendToBeAdded>Vincent_special_Friend_43550_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>